{"config": [{"config": {"filters": 10, "data_format": "channels_last", "name": "conv2d_1", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [4, 4], "batch_input_shape": [null, 48, 48, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"filters": 10, "data_format": "channels_last", "name": "conv2d_2", "bias_regularizer": null, "kernel_size": [4, 4], "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 10, "data_format": "channels_last", "name": "conv2d_3", "bias_regularizer": null, "kernel_size": [4, 4], "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"filters": 10, "data_format": "channels_last", "name": "conv2d_4", "bias_regularizer": null, "kernel_size": [4, 4], "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 2, "activity_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6"}