{"keras_version": "2.0.6", "config": [{"config": {"dtype": "float32", "strides": [1, 1], "activation": "relu", "batch_input_shape": [null, 48, 48, 1], "name": "conv2d_1", "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "bias_regularizer": null, "trainable": true, "use_bias": true, "filters": 10, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "strides": [1, 1], "activation": "relu", "name": "conv2d_2", "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "trainable": true, "use_bias": true, "filters": 10, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_first", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_regularizer": null, "strides": [1, 1], "activation": "relu", "name": "conv2d_3", "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "trainable": true, "use_bias": true, "filters": 10, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "strides": [1, 1], "activation": "relu", "name": "conv2d_4", "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "trainable": true, "use_bias": true, "filters": 10, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_first", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "units": 3, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_1", "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}