{"keras_version": "2.0.6", "backend": "tensorflow", "config": [{"config": {"padding": "valid", "dtype": "float32", "trainable": true, "batch_input_shape": [null, 48, 48, 1], "bias_regularizer": null, "name": "conv2d_1", "bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "filters": 10}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "filters": 10, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_2", "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [4, 4], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "trainable": true, "filters": 10, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_3", "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [4, 4], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "filters": 10, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_4", "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [4, 4], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 2, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}