{"config": [{"config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "dtype": "float32", "data_format": "channels_last", "filters": 10, "trainable": true, "batch_input_shape": [null, 48, 48, 1], "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [4, 4], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "padding": "valid", "name": "conv2d_1"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "filters": 10, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [4, 4], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "padding": "valid", "name": "conv2d_2"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_first", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "filters": 10, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [4, 4], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "padding": "valid", "name": "conv2d_3"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "filters": 10, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [4, 4], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "padding": "valid", "name": "conv2d_4"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_first", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 2, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "name": "dense_1"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6"}