{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_size": [4, 4], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dtype": "float32", "filters": 10, "activity_regularizer": null, "batch_input_shape": [null, 48, 48, 1], "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "valid", "trainable": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_1"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_size": [4, 4], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "filters": 10, "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "padding": "valid", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_size": [4, 4], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "filters": 10, "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "padding": "valid", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_3"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_size": [4, 4], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "filters": 10, "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_regularizer": null, "padding": "valid", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_4"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_1", "trainable": true, "bias_constraint": null, "units": 3, "kernel_constraint": null}}], "keras_version": "2.0.6"}