{"config": [{"config": {"activation": "relu", "trainable": true, "kernel_size": [4, 4], "dilation_rate": [1, 1], "name": "conv2d_1", "filters": 10, "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activity_regularizer": null, "batch_input_shape": [null, 48, 48, 1]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_2", "filters": 10, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "trainable": true, "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_3", "filters": 10, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_4", "filters": 10, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "trainable": true, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "units": 3, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "keras_version": "2.0.6", "class_name": "Sequential", "backend": "tensorflow"}