{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "dtype": "float32", "bias_regularizer": null, "batch_input_shape": [null, 48, 48, 1], "bias_constraint": null, "name": "conv2d_1", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [4, 4], "data_format": "channels_last", "filters": 10, "strides": [1, 1], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [4, 4], "data_format": "channels_last", "filters": 10, "strides": [1, 1], "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_first", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_3", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [4, 4], "data_format": "channels_last", "filters": 10, "strides": [1, 1], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_4", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [4, 4], "data_format": "channels_last", "filters": 10, "strides": [1, 1], "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_first", "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "bias_regularizer": null, "units": 3, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}], "keras_version": "2.0.6"}