{"config": [{"config": {"bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_1", "batch_input_shape": [null, 48, 48, 1], "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "padding": "valid", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "use_bias": true, "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 10, "kernel_size": [4, 4], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_2", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "padding": "valid", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_size": [4, 4], "filters": 10}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_first", "padding": "valid", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_3", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "padding": "valid", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_size": [4, 4], "filters": 10}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_4", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "padding": "valid", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_size": [4, 4], "filters": 10}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_first", "padding": "valid", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "units": 4, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6"}