{"keras_version": "2.0.6", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 10, "trainable": true, "kernel_regularizer": null, "batch_input_shape": [null, 48, 48, 1], "dilation_rate": [1, 1], "kernel_size": [4, 4], "activation": "relu", "name": "conv2d_1", "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 10, "trainable": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [4, 4], "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_first", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_3", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 10, "trainable": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [4, 4], "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_4", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 10, "trainable": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [4, 4], "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_first", "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"units": 3, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}], "backend": "tensorflow"}