{"backend": "tensorflow", "config": [{"config": {"activation": "relu", "filters": 10, "kernel_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 48, 48, 1], "strides": [1, 1], "padding": "valid", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [4, 4], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "trainable": true, "data_format": "channels_last", "name": "conv2d_1"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "filters": 10, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "name": "conv2d_2"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "filters": 10, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "name": "conv2d_3"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "filters": 10, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "name": "conv2d_4"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "units": 2, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.6"}