{"backend": "tensorflow", "keras_version": "2.0.6", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"filters": 10, "data_format": "channels_last", "trainable": true, "dtype": "float32", "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "kernel_size": [4, 4], "bias_regularizer": null, "batch_input_shape": [null, 48, 48, 1], "bias_constraint": null, "padding": "valid", "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"filters": 10, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_size": [4, 4]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "data_format": "channels_first", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"filters": 10, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_size": [4, 4]}}, {"class_name": "Conv2D", "config": {"filters": 10, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "relu", "kernel_size": [4, 4]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "data_format": "channels_first", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "activation": "relu"}}]}