{"config": [{"config": {"filters": 10, "activation": "relu", "dtype": "float32", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "batch_input_shape": [null, 48, 48, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "strides": [1, 1], "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [4, 4]}, "class_name": "Conv2D"}, {"config": {"filters": 10, "activation": "relu", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "strides": [1, 1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [4, 4]}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 10, "activation": "relu", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "strides": [1, 1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [4, 4]}, "class_name": "Conv2D"}, {"config": {"filters": 10, "activation": "relu", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "strides": [1, 1], "bias_constraint": null, "padding": "valid", "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [4, 4]}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "units": 3, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Sequential"}