{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [4, 4], "activation": "relu", "name": "conv2d_1", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "filters": 10, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 48, 48, 1]}}, {"class_name": "Conv2D", "config": {"kernel_size": [4, 4], "activation": "relu", "name": "conv2d_2", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "filters": 10, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_first", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [4, 4], "activation": "relu", "name": "conv2d_3", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "filters": 10, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_size": [4, 4], "activation": "relu", "name": "conv2d_4", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "filters": 10, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_first", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "name": "dense_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "units": 2, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true}}], "keras_version": "2.0.6", "backend": "tensorflow"}