{"config": [{"config": {"kernel_size": [4, 4], "name": "conv2d_1", "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "activity_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 48, 48, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 10, "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_size": [4, 4], "name": "conv2d_2", "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 10, "padding": "valid", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [4, 4], "name": "conv2d_3", "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 10, "padding": "valid", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_size": [4, 4], "name": "conv2d_4", "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 10, "padding": "valid", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activation": "relu", "units": 3, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}], "keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Sequential"}